"""4. Пользователь вводит строку из нескольких слов, разделённых пробелами.
Вывести каждое слово с новой строки. Строки необходимо пронумеровать.
Если в слово длинное, выводить только первые 10 букв в слове."""

x = input("Введите слова разделенные пробелом:")
for idx, word in enumerate(x.split(' ')):
    print(f'{idx}:{word[:10]}')