"""1. Создать список и заполнить его элементами различных типов данных.
Реализовать скрипт проверки типа данных каждого элемента.
Использовать функцию type() для проверки типа. Элементы списка можно не запрашивать у пользователя,
а указать явно, в программе."""

x = [1, 2, 3]
y = ["один", "два", "три"]
z = [1, "fcvv", "ccc", 123.456]

print (type(x[0]))
print (type(y[1]))
print (type(z[1]))
print (type(z[3]))


