"""5. Запросите у пользователя значения выручки и издержек фирмы.
Определите, с каким финансовым результатом работает фирма
(прибыль — выручка больше издержек, или убыток — издержки больше выручки).
Выведите соответствующее сообщение. Если фирма отработала с прибылью,
вычислите рентабельность выручки (соотношение прибыли к выручке).
Далее запросите численность сотрудников фирмы и определите прибыль фирмы в расчете на одного сотрудника."""

profit = int (input("Введите выручку:"))
loss = int (input("Введите расходы:"))
empl = int(input("Введите количество сотрудников:"))
total = profit-loss
if (total < 0):
    print ("Ваш убыток составил:", total)
elif (total > 0):
    print ("Ваша прибыль составила:", total)
    print("Ваша рентабельность составляет:", profit / loss)
if (total > 0):
    print ("Ваша прибыль в расчёте на сотрудника составляет:", profit / empl)
else:
    print ("Ваши работники ничего не заработали")





